app/views/users/show.html.erb

  <tbody>
    <% @user.microposts.each do |micropost| %>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 2]]